# Homework 2: playing with pandas dataframe
By Gao tianqi (Edward)

student number: 1901212578

Data source: http://archive.ics.uci.edu/ml/datasets/Polish+companies+bankruptcy+data

## Step 0: Import  Libraries and Dataset

In [349]:
from scipy.io import arff
import pandas as pd
from sklearn.impute import SimpleImputer as Impute

In [350]:
data = arff.loadarff('4year.arff')
df = pd.DataFrame(data[0])

## Step 1: Generate New Data Set with 4 Features

### (1) Select the "Attr1, 2, 7, 10" and "class" from dataset and rename column names

In [351]:
df = df[['Attr1','Attr2','Attr7','Attr10','class']]
newColNames = ['X1','X2','X7','X10','class']
df.columns = newColNames

### (2) Imput the NAN value with column-avg of other samples

In [352]:
df.isnull().sum()

X1       1
X2       1
X7       1
X10      1
class    0
dtype: int64

In [353]:
# impute missing values via the column mean
imputer = Impute()
imputed_data = imputer.fit(df.values).transform(df.values)

all_company_df = pd.DataFrame(imputed_data)
all_company_df.columns = newColNames
all_company_df.isnull().sum()

X1       0
X2       0
X7       0
X10      0
class    0
dtype: int64

## Step 2: Genarate 3 Company Groups and Answer the Questions for Each Group

### (1) Group 1: all-companies group

In [354]:
all_company_df

            X1       X2        X7      X10  class
0     0.159290  0.46240  0.189480  0.38330    0.0
1    -0.127430  0.46243 -0.127430  0.53757    0.0
2     0.070488  0.23570  0.086895  0.67689    0.0
3     0.136760  0.40538  0.136760  0.58938    0.0
4    -0.110080  0.69793 -0.110080  0.30207    0.0
...        ...      ...       ...      ...    ...
9787  0.004676  0.54949  0.013002  0.43205    1.0
9788 -0.027610  0.60748 -0.027610  0.33509    1.0
9789 -0.238290  0.62708 -0.240360  0.17760    1.0
9790  0.097188  0.75300  0.104280  0.24700    1.0
9791  0.021416  0.48678  0.027253  0.51267    1.0

[9792 rows x 5 columns]

##### Calculate mean and std for X1 to X4 in this group

In [355]:
all_company_df_description = all_company_df.describe().loc[['mean', 'std']][['X1','X2','X7','X10']]
all_company_df_description.index = ['all_company_group_mean','all_company_group_std']
all_company_df_description

                              X1        X2        X7       X10
all_company_group_mean  0.043019  0.596404  0.059446  0.389040
all_company_group_std   0.359303  4.586887  0.533317  4.590064

##### Get the number of How many companies satisfy the conditions in this group

In [356]:
mean1 = all_company_df_description['X1'].loc['all_company_group_mean']
mean10 = all_company_df_description['X10'].loc['all_company_group_mean']
std1 = all_company_df_description['X1'].loc['all_company_group_std']
std10 = all_company_df_description['X10'].loc['all_company_group_std']
all_company_counter = sum((all_company_df['X1']<mean1-std1) & (all_company_df['X10']<mean10-std10))
all_company_counter

15

### (2) Group 2: Bankrupt companies group

In [357]:
bankrupt_df = all_company_df[all_company_df['class'] == 1 ]
bankrupt_df

            X1       X2        X7       X10  class
9277  0.211500  1.33400  0.211500 -0.334230    1.0
9278 -0.129590  0.99630 -0.129590  0.003893    1.0
9279  0.064481  0.64146  0.071695  0.358540    1.0
9280 -0.081825  1.10050 -0.081825 -0.100480    1.0
9281  0.102180  0.42492  0.126920  0.574980    1.0
...        ...      ...       ...       ...    ...
9787  0.004676  0.54949  0.013002  0.432050    1.0
9788 -0.027610  0.60748 -0.027610  0.335090    1.0
9789 -0.238290  0.62708 -0.240360  0.177600    1.0
9790  0.097188  0.75300  0.104280  0.247000    1.0
9791  0.021416  0.48678  0.027253  0.512670    1.0

[515 rows x 5 columns]

##### Calculate mean and std for X1 to X4 in this group

In [358]:
bankrupt_df_description = bankrupt_df.describe().loc[['mean', 'std']][['X1','X2','X7','X10']]
bankrupt_df_description.index = ['bankrupt_group_mean','bankrupt_group_std']
bankrupt_df_description

                           X1        X2        X7       X10
bankrupt_group_mean -0.068873  0.878355 -0.061538  0.103367
bankrupt_group_std   0.568076  1.945596  0.568432  1.946747

##### Get the number of How many companies satisfy the conditions in this group

In [359]:
mean1 = bankrupt_df_description['X1'].loc['bankrupt_group_mean']
mean10 = bankrupt_df_description['X10'].loc['bankrupt_group_mean']
std1 = bankrupt_df_description['X1'].loc['bankrupt_group_std']
std10 = bankrupt_df_description['X10'].loc['bankrupt_group_std']
bankrupt_counter = sum((bankrupt_df['X1']<mean1-std1) & (bankrupt_df['X10']<mean10-std10))
bankrupt_counter

4

### (3) Group 3: Still operating companies group

In [360]:
still_operating_df = all_company_df[all_company_df['class'] == 0 ]
still_operating_df

            X1       X2        X7      X10  class
0     0.159290  0.46240  0.189480  0.38330    0.0
1    -0.127430  0.46243 -0.127430  0.53757    0.0
2     0.070488  0.23570  0.086895  0.67689    0.0
3     0.136760  0.40538  0.136760  0.58938    0.0
4    -0.110080  0.69793 -0.110080  0.30207    0.0
...        ...      ...       ...      ...    ...
9272  0.026806  0.40065  0.036525  0.59935    0.0
9273  0.046223  0.31314  0.059665  0.68686    0.0
9274  0.412940  0.21516  0.412940  0.78484    0.0
9275  0.062592  0.54828  0.072901  0.45172    0.0
9276  0.054063  0.32409  0.054063  0.67591    0.0

[9277 rows x 5 columns]

##### Calculate mean and std for X1 to X4 in this group

In [361]:
still_operating_df_description = still_operating_df.describe().loc[['mean', 'std']][['X1','X2','X7','X10']]
still_operating_df_description.index = ['still_operating_group_mean','still_operating_group_std']
still_operating_df_description

                                  X1        X2        X7       X10
still_operating_group_mean  0.049231  0.580752  0.066162  0.404899
still_operating_group_std   0.343002  4.689694  0.530524  4.692934

##### Get the number of How many companies satisfy the conditions in this group

In [362]:
mean1 = still_operating_df_description['X1'].loc['still_operating_group_mean']
mean10 = still_operating_df_description['X10'].loc['still_operating_group_mean']
std1 = still_operating_df_description['X1'].loc['still_operating_group_std']
std10 = still_operating_df_description['X10'].loc['still_operating_group_std']
still_operating_counter = sum((still_operating_df['X1']<mean1-std1) & (still_operating_df['X10']<mean10-std10))
still_operating_counter

11

## Step 3: Calculate the Ratio of Bankrupted Company for Each Group

##### Ratio for Group 1

In [363]:
ratio_all_company_group = sum(all_company_df['class'] == 1)/all_company_df.shape[0]
ratio_all_company_group

0.052593954248366014

##### Ratio for Group 2

In [364]:
ratio_bankrupt_group = sum(bankrupt_df['class'] == 1)/bankrupt_df.shape[0]
ratio_bankrupt_group

1.0

##### Ratio for Group 3

In [365]:
ratio_still_operating_group = sum(still_operating_df['class'] == 1)/still_operating_df.shape[0]
ratio_still_operating_group

0.0

# Homework 1: Summary

### (1) The MEANs and STDs for each groups

In [369]:
std_mean_df = pd.concat([all_company_df_description, bankrupt_df_description, still_operating_df_description], axis=0)
std_mean_df

                                  X1        X2        X7       X10
all_company_group_mean      0.043019  0.596404  0.059446  0.389040
all_company_group_std       0.359303  4.586887  0.533317  4.590064
bankrupt_group_mean        -0.068873  0.878355 -0.061538  0.103367
bankrupt_group_std          0.568076  1.945596  0.568432  1.946747
still_operating_group_mean  0.049231  0.580752  0.066162  0.404899
still_operating_group_std   0.343002  4.689694  0.530524  4.692934

### (2) Number of satisfying-condition companies in each group

In [373]:
count_table = {
    'All-Company Group':[all_company_counter],
    'Bankrupt Group':[bankrupt_counter],
    'Still Operating Group':[still_operating_counter]
}
count_df = pd.DataFrame(count_table)
count_df.index = ['Number of Satisfying-Condition Company']
count_df

,All-Company Group,Bankrupt Group,Still Operating Group
Number of Satisfying-Condition Company,15,4,11

### (3) Ratio of Bankrupt Companies in Each Group

In [374]:
ratio_table = {
    'All-Company Group':[ratio_all_company_group],
    'Bankrupt Group':[ratio_bankrupt_group],
    'Still Operating Group':[ratio_still_operating_group ]
}
ratio_df = pd.DataFrame(ratio_table)
ratio_df.index = ['Ratio of Bankrupted Company']
ratio_df

,All-Company Group,Bankrupt Group,Still Operating Group
Ratio of Bankrupted Company,0.052594,1.0,0.0